def area(a, b): 
    '''Возвращает площадь прямоугольника со сторонами a и b.

        Параметры:
                a (float): величина первой стороны прямоугольника
                b (float): величина второй стороны прямоугольника

        Возвращаемое значение:
                area(a, b) (float): площадь прямоугольника'''
    return a * b 

def perimeter(a, b): 
    '''Возвращает периметр прямоугольника со сторонами a и b.

        Параметры:
                a (float): величина первой стороны прямоугольника
                b (float): величина второй стороны прямоугольника

        Возвращаемое значение:
                area(a, b) (float): периметр прямоугольника'''
    return (a + b) * 2

